{
  "personal": {
    "name": "Gonzalo Azaldegi",
    "title": "Web Developer & Designer",
    "location": "Bilbao, Bizkaia",
    "email": "me@azaldev.com",
    "phone": "+34-688-89-98-01",
    "website": "azaldev.com"
  },
  "experience": [
    {
      "company": "Accenture",
      "period": "2023 - 2024",
      "description": "Se contribuyó a la mejora de una aplicación interna utilizando Visual Basic .NET y Python. Se implementaron soluciones de automatización para optimizar procesos internos y mejorar la eficiencia de los proyectos. Se colaboró con equipos multidisciplinarios en proyectos ágiles, aplicando metodologías Scrum para garantizar la entrega continua de funcionalidades."
    },
    {
      "company": "Tu Nueva Web",
      "period": "2024 - Actual",
      "description": "Desarrollo de un servicio integral para la creación, alojamiento y optimización de sitios web, asegurando una presencia online segura y eficiente. Los clientes pueden centrarse en hacer crecer sus negocios mientras se gestiona la parte técnica, garantizando que los sitios sean rápidos, seguros y visibles. Se ofrece soporte y alojamiento confiable, manteniendo todo funcionando sin problemas."
    }
  ],
  "education": [
    {
      "school": "CIFP Txurdinaga LHII",
      "degree": "Técnico Superior en Desarrollo de Aplicaciones Multiplataforma",
      "period": "2023 - 2024",
      "description": "Formación en el desarrollo de aplicaciones, utilizando tecnologías como Kotlin, con un enfoque en bases de datos y gestión de servicios.",
      "subjects": [
        "Programación orientada a objetos",
        "Desarrollo de aplicaciones móviles con Android",
        "Gestión de bases de datos",
        "Servicios y procesos en sistemas informáticos"
      ],
      "projects": [
        "Desarrollo de aplicaciones empresariales con Kotlin y .NET",
        "Implementación de sistemas distribuidos",
        "Creación de apps móviles",
        "Gestión de proyectos con metodologías ágiles"
      ]
    },
    {
      "school": "CIFP Txurdinaga LHII",
      "degree": "Técnico Superior en Desarrollo de Aplicaciones Web",
      "period": "2021 - 2023",
      "description": "Especialización en el desarrollo de aplicaciones web full-stack, abordando tanto frontend como backend, con tecnologías modernas y metodologías ágiles.",
      "subjects": [
        "Desarrollo frontend con HTML, CSS, JavaScript y VUE",
        "Programación backend con PHP y /Laravel",
        "Diseño web responsive y accesibilidad"
      ],
      "projects": [
        "Desarrollo de aplicaciones web dinámicas (SPA y SSR)",
        "Implementación de APIs RESTful",
        "Optimización de rendimiento y SEO",
        "Integración de bases de datos SQL"
      ]
    }
  ],

  "skills": [
    "React",
    "Astro",
    "Vue",
    "Node",
    "Laravel",
    "PHP",
    "SQL",
    "Bootstrap",
    "TailwindCSS",
    "HTML/CSS",
    "JavaScript",
    "Figma"
  ],
  "languages": [
    {
      "name": "Español",
      "level": "Nativo"
    },
    {
      "name": "Euskera",
      "level": "Medio-Alto"
    },
    {
      "name": "English",
      "level": "Medio"
    }
  ],
  "projects": [
    {
      "title": "Generators Hub",
      "description": "Colección de generadores con interfaz inspirada en Discord que incluye un generador de README y paletas de colores, diseñado para simplificar el flujo de trabajo de desarrolladores.",
      "longDescription": "Generators Hub es una aplicación web moderna que ofrece herramientas esenciales para desarrolladores, incluyendo un generador de README con vista previa en tiempo real y un generador de paletas de colores con múltiples esquemas. Construido con Next.js 14, TypeScript y TailwindCSS, presenta una interfaz inspirada en Discord con animaciones fluidas y modo oscuro. El generador de paletas permite crear, exportar y compartir esquemas de colores en varios formatos, mientras que el generador de README facilita la creación de documentación profesional con formato Markdown. La aplicación está optimizada para SEO, es totalmente responsive y ofrece una experiencia de usuario moderna con toasts informativos y shortcuts de teclado.",
      "imageUrl": "/gen-hub.png",
      "link": "https://github.com/AzalDevX/generator-hub",
      "tags": ["Next.js", "TypeScript", "TailwindCSS", "Framer Motion"]
    },
    {
      "title": "Blog Tech",
      "description": "El blog es un espacio dedicado al desarrollo web, freelancing, tecnología y proyectos personales, donde se comparten artículos, guías y reflexiones sobre programación y emprendimiento digital.",
      "longDescription": "Se abordan temas como frontend moderno con Astro, Vue y TailwindCSS, estrategias para freelancing y negocios digitales, automatización sin backend, tecnología y software, incluyendo distribuciones Linux y gadgets, además del desarrollo de herramientas y templates. Construido con Astro y TailwindCSS, el blog ofrece una experiencia rápida, minimalista y optimizada para SEO y accesibilidad, garantizando una lectura fluida y eficiente sin necesidad de backend.",
      "imageUrl": "/devflow.png",
      "link": "https://lalo.lol/blog",
      "tags": ["Astro", "TailwindCSS", "Markdown"]
    },
    {
      "title": "Plantilla Bento Portfolio",
      "description": "Bento Portfolio es una plantilla moderna y responsive construida con Astro y Tailwind CSS, ideal para portfolios profesionales. Ofrece un diseño Bento-Grid, rendimiento ultrarrápido, modo oscuro y fácil personalización.",
      "longDescription": "Bento Portfolio es una plantilla moderna, minimalista y responsive para portfolios profesionales, construida con Astro y Tailwind CSS para ofrecer un rendimiento ultrarrápido, diseño limpio y optimización SEO. Su estética Bento-Grid, combinada con modo oscuro, personalización sencilla y estructura modular, la hace ideal para desarrolladores, diseñadores y freelancers que buscan una presencia online atractiva y eficiente. Además, es totalmente adaptable a cualquier pantalla, fácil de mantener y de desplegar en plataformas como Cloudflare",
      "imageUrl": "/bento.png",
      "link": "https://github.com/AzalDevX/bento-portfolio",
      "tags": ["Astro", "TailwindCSS", "AOS"]
    },
    {
      "title": "QR generator",
      "description": "Genera códigos QR personalizados con un diseño minimalista inspirado en la estética de Nothing. Este generador te permite crear QR funcionales y visualmente atractivos en segundos, manteniendo la simplicidad y elegancia.",
      "longDescription": "Not a Thing es una herramienta web que permite crear códigos QR de manera rápida y sencilla, con un diseño único que toma inspiración de la filosofía minimalista y el estilo de Nothing. Con una interfaz limpia y sin distracciones, los usuarios pueden generar códigos QR personalizados para diferentes enlaces, ya sea para sitios web, aplicaciones, redes sociales o información de contacto. La herramienta ofrece una experiencia fluida y eficiente, garantizando códigos de alta calidad que destacan por su estética moderna y cuidada. Ideal para quienes buscan un diseño sofisticado sin renunciar a la funcionalidad.",
      "imageUrl": "/not-a-thing.png",
      "link": "https://notathing.tech",
      "tags": ["Astro", "TailwindCSS", "JavaScript"]
    },
    {
      "title": "Bite & Smash",
      "description": "Se diseñó y desarrolló la página web de Bite & Smash, una hamburguesería, con el objetivo de destacar su menú y su propuesta gastronómica única.",
      "longDescription": "La web presenta un diseño atractivo y estructurado, con secciones claras para el menú, ubicaciones, contacto y redes sociales, asegurando una navegación intuitiva y accesible. Está optimizada para dispositivos móviles y cuenta con tiempos de carga rápidos, mejorando la experiencia del usuario. Además, se trabajó en la identidad visual del negocio, utilizando una estética coherente con su marca para reforzar su presencia digital y atraer a nuevos clientes.",
      "imageUrl": "/bite-and-smash.png",
      "link": "https://bite-and-smash.tunuevaweb.es",
      "tags": ["Astro", "TailwindCSS", "UI/UX"]
    },
    {
      "title": "TuNuevaWeb",
      "description": "Tu Nueva Web se especializa en la creación de soluciones web modernas, accesibles y optimizadas, permitiendo a cualquier persona o negocio establecer su presencia en línea de forma rápida y efectiva.",
      "longDescription": "Mediante el uso de tecnologías como Astro y TailwindCSS, se desarrollan sitios con un diseño minimalista, alto rendimiento y enfoque en la experiencia del usuario. Además, se ofrecen plantillas y herramientas diseñadas para facilitar la creación de páginas web sin complicaciones, sin depender de backend ni configuraciones complejas. Con una combinación de velocidad, usabilidad y buenas prácticas de SEO, Tu Nueva Web garantiza proyectos funcionales, atractivos y listos para destacar en el mundo digital.",
      "imageUrl": "/tunuevaweb.png",
      "link": "https://lalo.lol/tnw",
      "tags": ["Astro", "TailwindCSS", "SEO"]
    }
  ]
}
