{
  "personal": {
    "name": "Gonzalo Azaldegi",
    "title": "Web Developer & Designer",
    "location": "Bilbao, Bizkaia",
    "email": "me@azaldev.com",
    "phone": "+34-688-89-98-01",
    "website": "azaldev.com"
  },
  "experience": [
    {
      "company": "Accenture",
      "period": "2023 - 2024",
      "description": "Se contribuyó a la mejora de una aplicación interna utilizando Visual Basic .NET y Python. Se implementaron soluciones de automatización para optimizar procesos internos y mejorar la eficiencia de los proyectos. Se colaboró con equipos multidisciplinarios en proyectos ágiles, aplicando metodologías Scrum para garantizar la entrega continua de funcionalidades."
    },
    {
      "company": "Tu Nueva Web",
      "period": "2024 - Actual",
      "description": "Desarrollo de un servicio integral para la creación, alojamiento y optimización de sitios web, asegurando una presencia online segura y eficiente. Los clientes pueden centrarse en hacer crecer sus negocios mientras se gestiona la parte técnica, garantizando que los sitios sean rápidos, seguros y visibles. Se ofrece soporte y alojamiento confiable, manteniendo todo funcionando sin problemas."
    }
  ],
  "education": [
    {
      "school": "FP TXURDINAGA",
      "degree": "Aplicaciones Multiplataforma",
      "period": "2023 - 2024"
    },
    {
      "school": "FP TXURDINAGA",
      "degree": "Aplicaciones Web",
      "period": "2021 - 2023"
    }
  ],
  "skills": [
    "React",
    "Astro",
    "Vue",
    "Node",
    "Laravel",
    "PHP",
    "SQL",
    "Bootstrap",
    "TailwindCSS",
    "HTML/CSS",
    "JavaScript",
    "Figma"
  ],
  "languages": [
    {
      "name": "Español",
      "level": "Nativo"
    },
    {
      "name": "Euskera",
      "level": "Medio-Alto"
    },
    {
      "name": "English",
      "level": "Medio"
    }
  ],
  "projects": [
    {
      "title": "Blog Tech",
      "description": "El blog es un espacio dedicado al desarrollo web, freelancing, tecnología y proyectos personales, donde se comparten artículos, guías y reflexiones sobre programación y emprendimiento digital. Se abordan temas como frontend moderno con Astro, Vue y TailwindCSS, estrategias para freelancing y negocios digitales, automatización sin backend, tecnología y software, incluyendo distribuciones Linux y gadgets, además del desarrollo de herramientas y templates. Construido con Astro y TailwindCSS, el blog ofrece una experiencia rápida, minimalista y optimizada para SEO y accesibilidad, garantizando una lectura fluida y eficiente sin necesidad de backend.",
      "imageUrl": "/devflow.png",
      "link": "https://lalo.lol/blog"
    },
    {
      "title": "TuNuevaWeb",
      "description": "Tu Nueva Web se especializa en la creación de soluciones web modernas, accesibles y optimizadas, permitiendo a cualquier persona o negocio establecer su presencia en línea de forma rápida y efectiva. Mediante el uso de tecnologías como Astro y TailwindCSS, se desarrollan sitios con un diseño minimalista, alto rendimiento y enfoque en la experiencia del usuario. Además, se ofrecen plantillas y herramientas diseñadas para facilitar la creación de páginas web sin complicaciones, sin depender de backend ni configuraciones complejas. Con una combinación de velocidad, usabilidad y buenas prácticas de SEO, Tu Nueva Web garantiza proyectos funcionales, atractivos y listos para destacar en el mundo digital.",
      "imageUrl": "/tunuevaweb.png",
      "link": "https://lalo.lol/tnw"
    },
    {
      "title": "Bite & Smash",
      "description": "Se diseñó y desarrolló la página web de Bite & Smash, una hamburguesería, con el objetivo de destacar su menú y su propuesta gastronómica única. La web presenta un diseño atractivo y estructurado, con secciones claras para el menú, ubicaciones, contacto y redes sociales, asegurando una navegación intuitiva y accesible. Está optimizada para dispositivos móviles y cuenta con tiempos de carga rápidos, mejorando la experiencia del usuario. Además, se trabajó en la identidad visual del negocio, utilizando una estética coherente con su marca para reforzar su presencia digital y atraer a nuevos clientes.",
      "imageUrl": "/bite-and-smash.png",
      "link": "https://bite-and-smash.tunuevaweb.es"
    }
  ]
}
